{
    "help": {
        "general": {
            "description": "Description",
            "syntax": "Syntaxe",
            "parameters": "Paramètres",
            "noParam": "Pas de paramètres"
        },
        "ban": {
            "shortdesc": "(mod) Banni un utilisateur.",
            "description": "Commande accessible aux modérateurs. Bannissement temporaire d'un utilisateur. Ce dernier est immédiatement déconnecté s'il était connecté et ne pourra plus accéder au service jusqu'à ce que le délai spécifié se soit écoulé. Néanmoins le bannissement peut être levé prématurément avec la commande \"unban\". Seuls les utilisateurs ayant le rôle \"modérateurs\" peuvent bannir. Il n'est pas nécessaire qu l'utilisateur visé par le bannissement soit connecté. Tous les utilisateurs connecté sont immédiatement mis au courant de l'opération via le canal \"info\"",
            "syntax": "<utilisateur> <durée> <raison>",
            "parameters": [
                {
                    "name": "utilisateur",
                    "description": "Nom de l'utilisateur à bannir."
                },
                {
                    "name": "durée",
                    "description": "Un nombre suivi d'une unité de temps (h pour heure, d pour jour) ; ex : 1d pour 1 jour, 12h pour douze haures."
                },
                {
                    "name": "raison",
                    "description": "Raison pour laquelle le bannissement a été effectuée"
                }
            ]
        },
        "broadcast": {
            "shortdesc": "(mod, gm, admin) Diffuse un message sur le canal \"info\".",
            "description": "Commande accessible aux modérateurs, game masters, et administrateurs. Permet de poster des messages d'annonce à destination de tous les autres utilisateurs connectés. Il s'agit généralement de message d'annonce concernant la maintenance du service, ou des évènements à venir.",
            "syntax": "<annonce>",
            "parameters": [
                {
                    "name": "annonce",
                    "description": "Contenu de l'annonce qui sera diffusée sur le canal \"info\""
                }
            ]
        },
        "channels": {
            "shortdesc": "Affiche la liste des canaux de discussions.",
            "description": "Affiche la liste des canaux auxquels l'utilisateur est connecté ; ainsi que, pour chaque canal, s'il est actif ou pas. Certains canaux peuvent être rendu inactifs par l'utilisateur qui ne souhaite plus recevoir de message.",
            "syntax": "",
            "parameters": []
        },
        "commands": {
            "shortdesc": "Affiche la liste des commandes.",
            "description": "Affiche la liste des commandes disponnible pour les utilisateurs par l'ordre alphabétique.",
            "syntax": "",
            "parameters": []
        },
        "echo": {
            "shortdesc": "Affiche ce qui a été tapé en paramètre",
            "description": "Affiche ce qui a été tapé en paramètre de cette commande.",
            "syntax": "<texte>",
            "parameters": [
                {
                    "name": "texte",
                    "description": "Chaîne de caractères à afficher."
                }
            ]
        },
        "female": {
            "shortdesc": "Accorde au féminin les messages envoyés à l'utilisatrice.",
            "description": "Défini si les message envoyé à l'utilisateur seront accordés ou pas au féminin; ceci pour des questions d'internationalisation de chaînes de caractères pour des langues telles que français ou espagnol qui ont des accords en genre.",
            "syntax": "",
            "parameters": []
        },
        "global": {
            "shortdesc": "Poste un message sur le canal \"global\".",
            "description": "Permet à l'utilisateur de poster un message public sur le canal de discussion \"global\", à destination de tous les autres utilisateurs connectés. L'utilisattion de ce canal est principalement OOC (out-of-character) et les discussions les plus diverse ont lieu sur ce canal.",
            "syntax": "<message>",
            "parameters": [
                {
                    "name": "message",
                    "description": "Contenu du message à afficher sur le canal \"global\""
                }
            ]
        },
        "help": {
            "shortdesc": "Affichage de l'aide en ligne",
            "description": "Affiche le document d'aide correspondant au sujet spécifié en paramètre",
            "syntax": "<sujet>",
            "parameters": [
                {
                    "name": "sujet",
                    "description": "Sujet spécifié."
                }
            ]
        },
        "logout": {
            "shortdesc": "Déconnexion.",
            "description": "L'utilisateur se déconnecte du service.",
            "syntax": "",
            "parameters": []
        },
        "newbie": {
            "shortdesc": "Poste un message dans le canal \"newbie\".",
            "description": "Permet de poster un message sur le canal \"newbie\", si le message se termine par \"?\" il sera coloré différemment de manière à apparaitre distinctement comme une question ou une demande d'assistance. Utilisée sans paramètre : active ou désactive alternativement l'écoute sur le canal \"newbie\". Lorsque l'écoute est désactivée l'utilisateur ne reçois plus de message en provenance de ce canal. L'écoute se réactive automatiquement lorsque l'utilisateur utilise la commande pout poster un message.",
            "syntax": "",
            "parameters": []
        },
        "passwd": {
            "shortdesc": "Change le mot de passe utilisateur (interactif).",
            "description": "Procède au changement du mot de passe de l'utilisateur. Notez que la commande ne prend pas de paramètres : le système demandera l'ancien et le nouveau mot de passe de manière interactive.",
            "syntax": "",
            "parameters": []
        },
        "readmsg": {
            "shortdesc": "Lecture des messages privés.",
            "description": "Affiche le plus ancien message privé non lu, envoyé par un autre utilisateur. Voir la commande \"sendmsg\" pour savoir comment envoyer des message privé à destination d'utilisateur non connectés.",
            "syntax": "",
            "parameters": []
        },
        "rp": {
            "shordesc": "Poste su le canal \"roleplay\"",
            "description": "Poste un message public sur le canal \"roleplay\". Comme son nom l'indique, ce canal est réservé aux discussions lié au jeu de rôle, qui privilégient l'immersion dans l'univers du jeu. Lancée sans paramètre, cette commande active ou désactive alternativement le canal \"roleplay\". Lorsque désactivé, plus aucun message en provenance de ce canal ne provient à l'utilisateur. Le canal se réactive automatiquement lorsque l'utilisateur utilise cette commande pour envoyer un message.",
            "syntax": "<message>",
            "parameters": [
                {
                    "name": "message",
                    "description": "Contenu du message à poster dans le canal \"roleplay\""
                }
            ]
        },
        "sendmsg": {
            "shortdesc": "Envoi d'un message privé.",
            "description": "Permet d'envoyer un message privé à un autre utilisateur, qu'il soit connecté ou pas. S'il l'utilisateur destinataire est connecté, il recevra le message immédiatement. Si l'utilisateur destinataire n'est pas connecté, le message sera stocké, et le destinataire pourra le lire en utilisant la commande \"readmsg\".",
            "syntax": "<destinataire> <message>",
            "parameters": [
                {
                    "name": "destinataire",
                    "description": "Nom de l'utilisateur destinataire du message."
                },
                {
                    "name": "message",
                    "description": "Message à transmettre au destinataire."
                }
            ]
        },
        "time": {
            "shortdesc": "Affiche l'heure du serveur.",
            "description": "Affiche l'heure du serveur, le fuseau horaire, et la phase de la lune.",
            "syntax": "",
            "parameters": []
        },
        "unban": {
            "shortdesc": "(mod) Lève le bannissement d'un utilisateur.",
            "description": "Commande accessible aux modérateurs. A utiliser pour mettre prématurément fin au bannissement d'un utilisateur et permettre à ce dernier de pouvoir se reconnecter au service immédiatement. Tous les utilisateurs sont mis au courant de l'opération via le canal \"info\".",
            "syntax": "<utilisateur>",
            "parameters": [
                {
                    "name": "utilisateur",
                    "description": "Nom de l'utilisateur visé par le bannissement."
                }
            ]
        },
        "who": {
            "shortdesc": "Affiche la liste des utilisateurs.",
            "description": "Affiche la liste des utilisateur enregistré sur le serveur, la liste est triée, les utilisateur connecté apparaissent en tête de liste. Il est possible d'affiner la recher en entrant quelque caractères paramètre, dans ce cas, seul les utilisateurs dont le nom comporte cette suite de caractère seront affichés.",
            "syntax": "[filtre]",
            "parameters": [
                {
                    "name": "filtre",
                    "description": "Si spécifié, seuls s'afficheront les utilisateur dont le nom contient le filtre spécifié."
                }
            ]
        }
    }
}
