{
    "help": {
        "general": {
            "description": "Description",
            "syntax": "Syntax",
            "parameters": "Parameters",
            "noParam": "No parameters"
        },
        "ban": {
            "shortdesc": "(mod) Ban a user for a specific duration/reason.",
            "description": "Command available to moderators. Temporarily bans a user. The user is immediately disconnected if they are online and will not be able to access the service until the specified duration has elapsed. However, the ban can be lifted early using the \"unban\" command. Only users with the \"moderator\" role can ban others. The targeted user does not need to be connected. All connected users are notified via the \"info\" channel.",
            "syntax": "<user> <duration> <reason>",
            "parameters": [
                {
                    "name": "user",
                    "description": "Name of the user to ban."
                },
                {
                    "name": "duration",
                    "description": "A number followed by a time unit (h for hours, d for days); e.g., 1d for 1 day, 12h for twelve hours."
                },
                {
                    "name": "reason",
                    "description": "Reason for the ban."
                }
            ]
        },
        "broadcast": {
            "shortdesc": "Post an announcement on the \"info\" channel.",
            "description": "Allows administrators or service accounts to post announcement messages to all other connected users. These messages typically concern service maintenance or upcoming events.",
            "syntax": "<announcement>",
            "parameters": [
                {
                    "name": "announcement",
                    "description": "Content of the announcement to be broadcast on the \"info\" channel."
                }
            ]
        },
        "channels": {
            "shortdesc": "Display a list of active channels.",
            "description": "Displays the list of channels the user is connected to, along with whether each channel is active or not. Some channels can be deactivated by the user if they no longer wish to receive messages from them.",
            "syntax": "",
            "parameters": []
        },
        "commands": {
            "shortdesc": "Display a list of commands.",
            "description": "Display a list of commands available to users, and a short description of what the command do. Commands are listed by alphabetic order.",
            "syntax": "",
            "parameters": []
        },
        "echo": {
            "shortdesc": "Display parameters.",
            "description": "Repeats what was typed as a parameter for this command.",
            "syntax": "<text>",
            "parameters": [
                {
                    "name": "text",
                    "description": "String to display."
                }
            ]
        },
        "female": {
            "shortdesc": "Set feminine/non-feminine feedback préférences.",
            "description": "Allows switching from a 'non-feminine' gender to a 'feminine' gender; this is for internationalization purposes in languages such as French or Spanish, which have gender agreements in strings.",
            "syntax": "",
            "parameters": []
        },
        "global": {
            "shortdesc": "Post a message on the \"global\" channel (mostly ooc).",
            "description": "Allows the user to post a public message on the \"global\" discussion channel, intended for all other connected users. This channel is primarily used for OOC (out-of-character) discussions and hosts a wide variety of conversations.",
            "syntax": "<message>",
            "parameters": [
                {
                    "name": "message",
                    "description": "Content of the message to display on the \"global\" channel."
                }
            ]
        },
        "help": {
            "shortdesc": "Displays a topic.",
            "description": "Displays a topic.",
            "syntax": "<topic>",
            "parameters": [
                {
                    "name": "topci",
                    "description": "Topic to be displayed."
                }
            ]
        },
        "logout": {
            "shortdesc": "Disconnect user",
            "description": "The user disconnects from the service.",
            "syntax": "",
            "parameters": []
        },
        "newbie": {
            "shortdesc": "Post a message on \"newbie\" channel.",
            "description": "Allows you to post a message on the \"newbie\" channel. If the message ends with \"?\", it will be color-coded to clearly appear as a question or a request for assistance. Used without parameters: toggles listening on the \"newbie\" channel. When listening is disabled, the user no longer receives messages from this channel. Listening is automatically re-enabled when the user uses the command to post a message.",
            "syntax": "[message]",
            "parameters": [
                {
                    "name": "message",
                    "description": "Message content to be post on \"newbie\" message."
                }
            ]
        },
        "ooc": {
            "shortdesc": "Posts a message on the OOC channel",
            "description": "Posts a public message on the OOC channel. This channel is for Out of character discussions (real life, chit chat, weather...). Also you may deactivate this channel if the command is run with no parameters. The channel will auto-reactivate the next time you use the command.",
            "syntax": "[message]",
            "parameters": [
                {
                    "name": "message",
                    "description": "Message to be post on channel"
                }
            ]
        },
        "passwd": {
            "shortdesc": "Change user password",
            "description": "Changes the user's password. Note that this command does not take parameters: the system will interactively prompt for the old and new passwords.",
            "syntax": "",
            "parameters": []
        },
        "pub": {
            "shortdesc": "Posts a message on the Public channel",
            "description": "Posts a public message on the Public channel. This channel is mostly for In-character discussions (Usually game information, assistance...). This channel could be considered as a giant virtual tavern where characters can talk. Also you may deactivate this channel if the command is run with no parameters. The channel will auto-reactivate the next time you use the command.",
            "syntax": "[message]",
            "parameters": [
                {
                    "name": "message",
                    "description": "Message to be post on channel"
                }
            ]
        },
        "readmsg": {
            "shortdesc": "Read offline messages",
            "description": "Will print the first unread message received when offline from another user.",
            "syntax": "",
            "parameters": []
        },
        "rp": {
            "shortdesc": "Post messages on channel \"roleplay\"",
            "description": "Post a public message in the \"roleplay\" channel. As its name suggests, this channel is reserved for discussions related to role-playing games, which prioritize immersion in the game world. When used without parameters, this command toggles the \"roleplay\" channel on and off. When disabled, the user will no longer receive messages from this channel. The channel automatically reactivates when the user uses this command to send a message.",
            "syntax": "[message]",
            "parameters": [
                {
                    "name": "message",
                    "description": "Message to post in channel \"roleplay\""
                }
            ]
        },
        "sendmsg": {
            "shortdesc": "Send private message to online/offline users",
            "description": "Allows sending a private message to another user, whether they are connected or not. If the recipient is connected, they will receive the message immediately. If the recipient is not connected, the message will be stored, and the recipient can read it later using the \"readmsg\" command.",
            "syntax": "<recipient> <message>",
            "parameters": [
                {
                    "name": "recipient",
                    "description": "Name of the user receiving the message."
                },
                {
                    "name": "message",
                    "description": "Message to send to the recipient."
                }
            ]
        },
        "staff": {
            "shortdesc": "Posts a message on the staff channel",
            "description": "Posts a public message on the staff channel. This channel is restricted to members of the staff (moderators, administrators, game masters). Also you may deactivate this channel if the command is run with no parameters. The channel will auto-reactivate the next time you use the command.",
            "syntax": "[message]",
            "parameters": [
                {
                    "name": "message",
                    "description": "Message to be post on channel"
                }
            ]
        },
        "tech": {
            "shortdesc": "Posts a message on the Tech channel",
            "description": "Posts a public message on the Tech channel. This channel is restricted to Technical topics (like bug reports or anything about game development). This kind of topics is immersion breaking, this is why this channel exists. Also you may deactivate this channel if the command is run with no parameters. The channel will auto-reactivate the next time you use the command.",
            "syntax": "[message]",
            "parameters": [
                {
                    "name": "message",
                    "description": "Message to be post on channel"
                }
            ]
        },
        "time": {
            "shortdesc": "Display server time",
            "description": "Displays the server time, time zone, and moon phase.",
            "syntax": "",
            "parameters": []
        },
        "unban": {
            "shortdesc": "(mod) Unban a user",
            "description": "Command available to moderators. When applied to a currently banned user, this command prematurely removes the ban and allows the banned user to regain the possibility to reconnect to the service. All connected users are notified via the \"info\" channel.",
            "syntax": "<user>",
            "parameters": [
                {
                    "name": "<user>",
                    "description": "Name of the user to unban."
                }
            ]
        },
        "who": {
            "shortdesc": "Print a list of users (can be filtered)",
            "description": "Displays the list of users registered on the server. The list is sorted, with connected users appearing at the top. The search can be refined by entering a few characters as a parameter. In this case, only users whose names contain the specified filter will be displayed.",
            "syntax": "[filter]",
            "parameters": [
                {
                    "name": "filter",
                    "description": "If specified, only users whose names contain the filter will be displayed."
                }
            ]
        }
    }
}
